using System;
using System.Collections.Generic;
using System.Linq;

namespace Docimax.Interface_ICD.Model.UploadModel.N041
{
    #region 医疗付款方式代码

    public enum 医疗付款方式代码
    {
        城镇职工基本医疗保险 = 01,
        城镇居民基本医疗保险 = 02,
        新型农村合作医疗 = 03,
        贫困救助 = 04,
        商业医疗保险 = 05,
        全公费 = 06,
        全自费 = 07,
        其他社会保险 = 08,
        其他 = 99
    }

    #endregion

    #region 性别代码

    public enum 性别代码
    {
        未知的性别 = 0,
        男 = 1,
        女 = 2,
        未说明的性别 = 9
    }

    #endregion

    #region 国籍代码

    public enum 国籍代码
    {
        ABW,//阿鲁巴
        AFG,//阿富汗
        AGO,//安哥拉
        AIA,//安圭拉
        ALB,//阿尔巴尼亚
        AND,//安道尔
        ANT,//荷属安的列斯
        ARE,//阿联酋
        ARG,//阿根廷
        ARM,//亚美尼亚
        ASM,//美属萨摩亚
        ATA,//南极洲
        ATF,//法属南部领土
        ATG,//安提瓜和巴布达
        AUS,//澳大利亚
        AUT,//奥地利
        AZE,//阿塞拜疆
        BDI,//布隆迪
        BEL,//比利时
        BEN,//贝宁
        BFA,//布基纳法索
        BGD,//孟加拉国
        BGR,//保加利亚
        BHR,//巴林
        BHS,//巴哈马
        BIH,//波斯尼亚和黑塞哥维那
        BLR,//白俄罗斯
        BLZ,//伯利兹
        BMU,//百幕大
        BOL,//玻利维亚
        BRA,//巴西
        BRB,//巴巴多斯
        BRN,//文莱
        BTN,//不丹
        BVT,//布维岛
        BWA,//博茨瓦纳
        CAF,//中非
        CAN,//加拿大
        CCK,//科科斯群岛
        CHE,//瑞士
        CHL,//智利
        CHN,//中国
        CIV,//科特迪瓦
        CMR,//喀麦隆
        COD,//刚果民主共和国
        COG,//刚果
        COK,//库克群岛
        COL,//哥伦比亚
        COM,//科摩罗
        CPV,//佛得角
        CRI,//哥斯达黎加
        CUB,//古巴
        CXR,//圣诞岛
        CYM,//开曼群岛
        CYP,//塞浦路斯
        CZE,//捷克
        DEU,//德国
        DJI,//吉布提
        DMA,//多米尼加
        DNK,//丹麦
        DOM,//多米尼家共和国
        DZA,//阿尔及利亚
        ECU,//厄瓜多尔
        EGY,//埃及
        ERI,//厄立特里亚
        ESH,//西撒哈拉
        ESP,//西班牙
        EST,//爱沙尼亚
        ETH,//埃塞俄比亚
        FIN,//芬兰
        FJI,//斐济
        FLK,//马尔维纳斯群岛
        FRA,//法国
        FRO,//法罗群岛
        FSM,//密克罗尼西亚
        GAB,//加蓬
        GBD,//英国（独立领土公民、出国不用）
        GBN,//英国（海外国民，出国不用）
        GBO,//英国（海外公民，出国不用）
        GBP,//英国（保护公民，出国不用）
        GBR,//英国
        GBS,//英国（隶属，出国不用）
        GEO,//格鲁吉亚
        GHA,//加纳
        GIB,//直布罗陀
        GIN,//几内亚
        GLP,//瓜德罗普
        GMB,//冈比亚
        GNB,//几内亚比绍
        GNQ,//赤道几内亚
        GRC,//希腊
        GRD,//格林纳达
        GRL,//格陵兰
        GTM,//危地马拉
        GUF,//法属圭亚那
        GUM,//关岛
        GUY,//圭亚那
        HKG,//香港
        HMD,//赫德岛和麦克唐纳岛
        HND,//洪都拉斯
        HRV,//克罗地亚
        HTI,//海地
        HUN,//匈牙利
        IDN,//印度尼西亚
        IND,//印度
        IOT,//英属印度洋领土
        IRL,//爱尔兰
        IRN,//伊朗
        IRQ,//伊拉克
        ISL,//冰岛
        ISR,//以色列
        ITA,//意大利
        JAM,//牙买加
        JOR,//约旦
        JPN,//日本
        JTN,//约翰斯顿岛
        KAZ,//哈萨克斯坦
        KEN,//肯尼亚
        KGZ,//吉尔吉斯斯坦
        KHM,//柬埔寨
        KIR,//基里巴斯
        KNA,//圣基茨和尼维斯
        KOR,//韩国（南朝鲜）
        KWT,//科威特
        LAO,//老挝
        LBN,//黎巴嫩
        LBR,//利比里亚
        LBY,//利比亚
        LCA,//圣卢西亚
        LIE,//列支敦土登
        LKA,//斯里兰卡
        LSO,//莱索托
        LTU,//立陶宛
        LUX,//卢森堡
        LVA,//拉脱维亚
        MAC,//澳门
        MAR,//摩洛哥
        MCO,//摩纳哥
        MDA,//摩尔多瓦
        MDG,//马达加斯加
        MDV,//马尔代夫
        MEX,//墨西哥
        MHL,//马绍尔群岛
        MID,//中途岛
        MKD,//马其顿
        MLI,//马里
        MLT,//马耳他
        MMR,//缅甸
        MNG,//蒙古
        MNP,//北马里亚纳
        MOZ,//莫桑比克
        MRT,//毛里塔尼亚
        MSR,//蒙特塞拉特
        MTQ,//马提尼克
        MUS,//毛里求斯
        MWI,//马拉维
        MYS,//马来西亚
        MYT,//马约特
        NAM,//纳米比亚
        NCL,//新喀里多尼亚
        NER,//尼日尔
        NFK,//诺福克岛
        NGA,//尼日利亚
        NIC,//尼加拉瓜
        NIU,//纽埃
        NLD,//荷兰
        NOR,//挪威
        NPL,//尼波尔
        NRU,//瑙鲁
        NTZ,//中间地带
        NZL,//新西兰
        OMN,//阿曼
        PAK,//巴基斯坦
        PAN,//巴拿马
        PCN,//皮特凯恩群岛
        PER,//秘鲁
        PHL,//菲律宾
        PLW,//贝劳
        PNG,//巴布亚新几内亚
        POL,//波兰
        PRI,//波多黎各
        PRK,//朝鲜
        PRT,//葡萄牙
        PRY,//巴拉圭
        PST,//巴勒斯坦
        PYF,//法属菠利尼西亚
        QAT,//卡塔尔
        REU,//留尼汪
        ROM,//罗马尼亚
        RUS,//俄罗斯
        RWA,//卢旺达
        SAU,//沙特阿拉伯
        SDN,//苏丹
        SEN,//塞内加尔
        SGP,//新加坡
        SGS,//南乔治亚岛和南桑德韦奇岛
        SHN,//圣赫勒拿
        SJM,//斯瓦尔巴群岛
        SLB,//所罗门群岛
        SLE,//塞拉利昂
        SLV,//萨尔瓦多
        SMR,//圣马力诺
        SOM,//索马里
        SPM,//圣皮埃尔和密克隆
        SS,// 塞班
        STP,//圣多美和普林西比
        SUR,//苏里南
        SVK,//斯洛伐克
        SVN,//斯洛文尼亚
        SWE,//瑞典
        SWZ,//斯威士兰
        SX,// 锡金
        SF,// 塞尔维亚
        SYC,//塞舌尔
        SYR,//叙利亚
        TCA,//特克斯和凯科斯群岛
        TCD,//乍得
        TGO,//多哥
        THA,//泰国
        TJK,//塔吉克斯坦
        TKL,//托克劳
        TKM,//土库曼斯坦
        TMP,//东帝汶
        TON,//汤加
        TTO,//特立尼达和多巴哥
        TUN,//突尼斯
        TUR,//土耳其
        TUV,//图瓦卢
        TWN,//台湾
        TZA,//坦桑尼亚
        UGA,//乌干达
        UKR,//乌克兰
        UMI,//美属太平洋各群岛
        UN,// 联合国
        UNA,//联合国
        UNO,//联合国
        URY,//乌拉圭
        USA,//美国
        UZB,//乌兹别克斯坦
        VAT,//梵蒂冈
        VCT,//圣文森特和格林纳丁斯
        VEN,//委内瑞拉
        VGB,//英属维尔京群岛
        VIR,//美属维尔京群岛
        VNM,//越南
        VUT,//瓦努阿图
        WAK,//威克岛
        WLF,//瓦利斯和富图纳群岛
        WSM,//西萨摩亚
        XXA,//无国籍（无国籍人）
        XXB,//无国籍（难民）
        XXX,//无国籍（未声明国籍）
        YEM,//也门
        YUG,//南斯拉夫
        ZAF,//南非
        ZAR,//扎伊尔
        ZMB,//赞比亚
        ZWE,//津巴布韦
        ZZZ,//国籍不详
    }

    #endregion

    #region 民族代码

    public enum RaceEnum
    {
        汉族 = 01,
        蒙古族 = 02,
        回族 = 03,
        藏族 = 04,
        维吾尔族 = 05,
        苗族 = 06,
        彝族 = 07,
        壮族 = 08,
        布依族 = 09,
        朝鲜族 = 10,
        满族 = 11,
        侗族 = 12,
        瑶族 = 13,
        白族 = 14,
        土家族 = 15,
        哈尼族 = 16,
        哈萨克族 = 17,
        傣族 = 18,
        黎族 = 19,
        傈僳族 = 20,
        佤族 = 21,
        畲族 = 22,
        高山族 = 23,
        拉祜族 = 24,
        水族 = 25,
        东乡族 = 26,
        纳西族 = 27,
        景颇族 = 28,
        柯尔克孜 = 29,
        土族 = 30,
        达斡尔族 = 31,
        仫佬族 = 32,
        羌族 = 33,
        布朗族 = 34,
        撒拉族 = 35,
        毛南族 = 36,
        仡佬族 = 37,
        锡伯族 = 38,
        阿昌族 = 39,
        普米族 = 40,
        塔吉克族 = 41,
        怒族 = 42,
        乌孜别克 = 43,
        俄罗斯族 = 44,
        鄂温克族 = 45,
        崩龙族 = 46,
        保安族 = 47,
        裕固族 = 48,
        京族 = 49,
        塔塔尔族 = 50,
        独龙族 = 51,
        鄂伦春族 = 52,
        赫哲族 = 53,
        门巴族 = 54,
        珞巴族 = 55,
        基诺族 = 56,
        其他 = 99
    }

    #endregion

    #region 职业代码

    public enum 职业代码
    {
        国家公务员 = 11,
        专业技术人员 = 13,
        职员 = 17,
        企业管理人员 = 21,
        工人 = 24,
        农民 = 27,
        学生 = 31,
        现役军人 = 37,
        自由职业者 = 51,
        个体经营者 = 54,
        无业人员 = 70,
        退离休人员 = 80,
        其他 = 90
    }

    #endregion

    #region 婚姻状况代码

    public enum 婚姻状况代码
    {
        未婚 = 10,
        已婚 = 20,
        初婚 = 21,
        再婚 = 22,
        复婚 = 23,
        丧偶 = 30,
        离婚 = 40,
        其他 = 90
    }

    #endregion

    #region 入院途径

    public enum 入院途径
    {
        急诊 = 1,
        门诊 = 2,
        其他医疗机构转入 = 3,
        其他 = 9
    }

    #endregion

    #region 科室代码

    public class 科室代码
    {
        private static Dictionary<string, string> keyDic = new Dictionary<string, string>
        {
            {"01","预防保健科"},
            {"02","全科医疗科"},
            {"03","内科"},
            {"03.01","呼吸内科专业"},
            {"03.02","消化内科专业"},
            {"03.03","神经内科专业"},
            {"03.04","心血管内科专业"},
            {"03.05","血液内科专业"},
            {"03.06","肾病学专业"},
            {"03.07","内分泌专业"},
            {"03.08","免疫学专业"},
            {"03.09","变态反应专业"},
            {"03.10","老年病专业"},
            {"03.11","其他"},
            {"04","外科"},
            {"04.01","普通外科专业"},
            {"04.01.01","肝脏移植项目"},
            {"04.01.02","胰腺移植项目"},
            {"04.01.03","小肠移植项目"},
            {"04.02","神经外科专业"},
            {"04.03","骨科专业"},
            {"04.04","泌尿外科专业"},
            {"04.04.01","肾脏移植项目"},
            {"04.05","胸外科专业"},
            {"04.05.01","肺脏移植项目"},
            {"04.06","心脏大血管外科专业"},
            {"04.06.01","心脏移植项目"},
            {"04.07","烧伤科专业"},
            {"04.08","整形外科专业"},
            {"04.09","其他"},
            {"05","妇产科"},
            {"05.01","妇科专业"},
            {"05.02","产科专业"},
            {"05.03","计划生育专业"},
            {"05.04","优生学专业"},
            {"05.05","生殖健康与不孕症专业"},
            {"05.06","其他"},
            {"06","妇女保健科"},
            {"06.01","青春期保健专业"},
            {"06.02","围产期保健专业"},
            {"06.03","更年期保健专业"},
            {"06.04","妇女心理卫生专业"},
            {"06.05","妇女营养专业"},
            {"06.06","其他"},
            {"07","儿科"},
            {"07.01","新生儿专业"},
            {"07.02","小儿传染病专业"},
            {"07.03","小儿消化专业"},
            {"07.04","小儿呼吸专业"},
            {"07.05","小儿心脏病专业"},
            {"07.06","小儿肾病专业"},
            {"07.07","小儿血液病专业"},
            {"07.08","小儿神经病学专业"},
            {"07.09","小儿内分泌专业"},
            {"07.10","小儿遗传病专业"},
            {"07.11","小儿免疫专业"},
            {"07.12","其他"},
            {"08","小儿外科"},
            {"08.01","小儿普通外科专业"},
            {"08.02","小儿骨科专业"},
            {"08.03","小儿泌尿外科专业"},
            {"08.04","小儿胸心外科专业"},
            {"08.05","小儿神经外科专业"},
            {"08.06","其他"},
            {"09","儿童保健科"},
            {"09.01","儿童生长发育专业"},
            {"09.02","儿童营养专业"},
            {"09.03","儿童心理卫生专业"},
            {"09.04","儿童五官保健专业"},
            {"09.05","儿童康复专业"},
            {"09.06","其他"},
            {"10","眼科"},
            {"11","耳鼻咽喉科"},
            {"11.01","耳科专业"},
            {"11.02","鼻科专业"},
            {"11.03","咽喉科专业"},
            {"11.04","其他"},
            {"12","口腔科"},
            {"12.01","口腔内科专业"},
            {"12.02","口腔颌面外科专业"},
            {"12.03","正畸专业"},
            {"12.04","口腔修复专业"},
            {"12.05","口腔预防保健专业"},
            {"12.06","其他"},
            {"13","皮肤科"},
            {"13.01","皮肤病专业"},
            {"13.02","性传播疾病专业"},
            {"13.03","其他"},
            {"14","医疗美容科"},
            {"15","精神科"},
            {"15.01","精神病专业"},
            {"15.02","精神卫生专业"},
            {"15.03","药物依赖专业"},
            {"15.04","精神康复专业"},
            {"15.05","社区防治专业"},
            {"15.06","临床心理专业"},
            {"15.07","司法精神专业"},
            {"15.08","其他"},
            {"16","传染科"},
            {"16.01","肠道传染病专业"},
            {"16.02","呼吸道传染病专业"},
            {"16.03","肝炎专业"},
            {"16.04","虫媒传染病专业"},
            {"16.05","动物源性传染病专业"},
            {"16.06","蠕虫病专业"},
            {"16.07","其它"},
            {"17","结核病科"},
            {"18","地方病科"},
            {"19","肿瘤科"},
            {"20","急诊医学科"},
            {"21","康复医学科"},
            {"22","运动医学科"},
            {"23","职业病科"},
            {"23.01","职业中毒专业"},
            {"23.02","尘肺专业"},
            {"23.03","放射病专业"},
            {"23.04","物理因素损伤专业"},
            {"23.05","职业健康监护专业"},
            {"23.06","其他"},
            {"24","临终关怀科"},
            {"25","特种医学与军事医学科"},
            {"26","麻醉科"},
            {"27","疼痛科"},
            {"28","重症医学科"},
            {"30","医学检验科"},
            {"30.01","临床体液、血液专业"},
            {"30.02","临床微生物学专业"},
            {"30.03","临床生化检验专业"},
            {"30.04","临床免疫、血清学专业"},
            {"30.05","临床细胞分子遗传学专业"},
            {"30.06","其他"},
            {"31","病理科"},
            {"32","医学影像科"},
            {"32.01","X线诊断专业"},
            {"32.02","CT诊断专业"},
            {"32.03","磁共振成像诊断专业"},
            {"32.04","核医学专业"},
            {"32.05","超声诊断专业"},
            {"32.06","心电诊断专业"},
            {"32.07","脑电及脑血流图诊断专业"},
            {"32.08","神经肌肉电图专业"},
            {"32.09","介入放射学专业"},
            {"32.10","放射治疗专业"},
            {"32.11","其他"},
            {"50","中医科"},
            {"50.01","内科专业"},
            {"50.02","外科专业"},
            {"50.03","妇产科专业"},
            {"50.04","儿科专业"},
            {"50.05","皮肤科专业"},
            {"50.06","眼科专业"},
            {"50.07","耳鼻咽喉科专业"},
            {"50.08","口腔科专业"},
            {"50.09","肿瘤科专业"},
            {"50.10","骨伤科专业"},
            {"50.11","肛肠科专业"},
            {"50.12","老年病科专业"},
            {"50.13","针灸科专业"},
            {"50.14","推拿科专业"},
            {"50.15","康复医学专业"},
            {"50.16","急诊科专业"},
            {"50.17","预防保健科专业"},
            {"50.18","其他"},
            {"51","民族医学科"},
            {"51.01","维吾尔医学"},
            {"51.02","藏医学"},
            {"51.03","蒙医学"},
            {"51.04","彝医学"},
            {"51.05","傣医学"},
            {"51.06","其他"},
            {"52","中西医结合科"},
            {"69","其他业务科室"},
        };
    }

    #endregion

    #region 入院病情代码

    public enum AdmittingCondition
    {
        有 = 1,
        临床未确定 = 2,
        情况不明 = 3,
        无 = 4
    }

    #endregion

    #region 血型编码

    public enum 血型编码
    {
        A型 = 1, B型 = 2, O型 = 3, AB型 = 4, 不详 = 5, 未查 = 6
    }

    #endregion

    #region Rh血型

    public enum Rh
    {
        阴 = 1, 阳 = 2, 不详 = 3, 未查 = 4
    }

    #endregion

    #region 手术级别

    public enum 手术级别
    {
        一级手术 = 1, 二级手术 = 2, 三级手术 = 3, 四级手术 = 4
    }

    #endregion

    #region 切口愈合等级

    public class 切口愈合等级
    {
        private static Dictionary<int, string> keyDic = new Dictionary<int, string>
        {
            {1,"0"},
            {2,"Ⅰ"},
            {3,"Ⅱ"},
            {4,"Ⅲ"},
        };
        public string this[int index]
        {
            get
            {
                var tempKeyDic = keyDic.FirstOrDefault(e => e.Key == index);
                if (tempKeyDic.Key != index)
                {
                    throw new Exception(string.Format("切口愈合等级中没有值为{0}的项目", index));
                }
                return tempKeyDic.Value;
            }
        }
    }

    #endregion

    #region 切口愈合类别

    public enum 切口愈合类别
    {
        甲 = 1,
        乙 = 2,
        丙 = 3,
        未知 = 9
    }

    #endregion

    #region 麻醉方式代码

    public enum 麻醉方式代码
    {
        全身麻醉 = 1,
        吸入麻醉 = 11,
        静脉麻醉 = 12,
        基础麻醉 = 13,
        椎管内麻醉 = 2,
        蛛网膜下腔阻滞麻醉 = 21,
        硬脊膜外腔阻滞麻醉 = 22,
        局部麻醉 = 3,
        神经丛阻滞麻醉 = 31,
        神经节阻滞麻醉 = 32,
        神经阻滞麻醉 = 33,
        区域阻滞麻醉 = 34,
        局部浸润麻醉 = 35,
        表面麻醉 = 36,
        复合麻醉 = 4,
        静吸复合全麻 = 41,
        针药复合麻醉 = 42,
        神经丛与硬膜外阻滞复合麻醉 = 43,
        全麻复合全身降温 = 44,
        全麻复合控制性降压 = 45,
        其他麻醉方法 = 9
    }

    #endregion

    #region 离院方式

    public enum 离院方式
    {
        医嘱离院 = 1,
        医嘱转院 = 2,
        医嘱转社区卫生服务机构乡镇卫生院 = 3,
        非医嘱离院 = 4,
        死亡 = 5,
        其他 = 9
    }

    #endregion

    #region 有无

    public enum 有无
    {
        无 = 1, 有 = 2
    }

    #endregion
}
