
namespace Docimax.Interface_ICD.Model.UploadModel
{
    #region 患者基本情况枚举

    public enum SexEnum
    {
        未知 = 0,
        男 = 1,
        女 = 2,
        未说明的性别 = 9,
    }

    public enum MarriageEnum
    {
        未婚 = 1,
        已婚 = 2,
        丧偶 = 3,
        离婚 = 4,
        其他 = 9
    }

    #region 民族代码

    public enum RaceEnum
    {
        汉族 = 01,
        蒙古族 = 02,
        回族 = 03,
        藏族 = 04,
        维吾尔族 = 05,
        苗族 = 06,
        彝族 = 07,
        壮族 = 08,
        布依族 = 09,
        朝鲜族 = 10,
        满族 = 11,
        侗族 = 12,
        瑶族 = 13,
        白族 = 14,
        土家族 = 15,
        哈尼族 = 16,
        哈萨克族 = 17,
        傣族 = 18,
        黎族 = 19,
        傈僳族 = 20,
        佤族 = 21,
        畲族 = 22,
        高山族 = 23,
        拉祜族 = 24,
        水族 = 25,
        东乡族 = 26,
        纳西族 = 27,
        景颇族 = 28,
        柯尔克孜 = 29,
        土族 = 30,
        达斡尔族 = 31,
        仫佬族 = 32,
        羌族 = 33,
        布朗族 = 34,
        撒拉族 = 35,
        毛南族 = 36,
        仡佬族 = 37,
        锡伯族 = 38,
        阿昌族 = 39,
        普米族 = 40,
        塔吉克族 = 41,
        怒族 = 42,
        乌孜别克 = 43,
        俄罗斯族 = 44,
        鄂温克族 = 45,
        崩龙族 = 46,
        保安族 = 47,
        裕固族 = 48,
        京族 = 49,
        塔塔尔族 = 50,
        独龙族 = 51,
        鄂伦春族 = 52,
        赫哲族 = 53,
        门巴族 = 54,
        珞巴族 = 55,
        基诺族 = 56,
        其他 = 99
    }

    #endregion

    #endregion

    #region 入院病情代码

    public enum AdmittingCondition
    {
        有 = 1,
        临床未确定 = 2,
        情况不明 = 3,
        无 = 4
    }

    #endregion

    #region 手术相关枚举
    
    #region 麻醉方式代码

    public enum Anesthesia
    {
        全身麻醉 = 1,
        吸入麻醉 = 11,
        静脉麻醉 = 12,
        静吸复合麻醉=13,
        基础麻醉 = 14,
        区域麻醉=2,
        椎管内麻醉 = 21,
        蛛网膜下腔阻滞麻醉 = 211,
        硬脊膜外腔阻滞麻醉 = 212,
        蛛网膜下硬膜外复合麻醉=213,
        神经及神经丛阻滞=22,
        颈丛阻滞=221,
        臂丛阻滞及上肢神经阻滞=222,
        腰骶神经丛阻滞及下肢神经阻滞=223,
        躯干神经阻滞_肋间神经阻滞=224,
        椎旁神经阻滞=225,
        阴神经阻滞=226,
        交感神经阻滞_星状神经节阻滞=227,
        胸腰交感神经阻滞=228,
        脑神经阻滞_三叉神经阻滞_舌咽神经阻滞=229,
        局部麻醉 = 3,
        表面麻醉 = 31,
        局部浸润麻醉_局 = 32,
        部阻滞麻醉_静脉 = 33,
        针刺镇痛与麻醉 = 4,
        复合麻醉=5,
        不同药物的复合=51,
        不同方法的复合=52,
        特殊方法的复合=53,
        其他麻醉方法 = 99
    }

    #endregion

    #region 切口愈合等级

    public enum IncisionHealingLevel
    {
        _0 = 1,
        Ⅰ = 2,
        Ⅱ = 3,
        Ⅲ = 4,
    }


    #endregion

    #region 切口愈合类别

    public enum IncisionHealingCategory
    {
        甲 = 1,
        乙 = 2,
        丙 = 3,
        未知 = 9
    }

    #endregion

    public enum OperationLevel
    {
        一级手术 = 1,
        二级手术 = 2,
        三级手术 = 3,
        四级手术 = 4
    }
    
    #endregion
}
